import random  # Підключаємо бібліотеку яка нам єбашить рандомні циферки


class Start:  # Це ми відкрили класс
    global list  # на це просто забей це костиль

    def __init__(self):  # Це тіп функція яка завжди виконується якщо виконується клас
        self.list = []  # це в нас пустий списко. Для визову його будь де пишем self.list
        for i in range(0, 10):
            self.list.append(random.randint(1, 40))  # Єбашим список на 10 елементів з рондомних цифер

    def print(self):  # твоє завдання, окунь
        pass  # Вивести список (pass можна стерти то просто щоб функ. не була пустою)


start = Start()  # Підключаємо клас
start.print()  # приклад як викликати функцію з класу

# self у функціях pycharm дописує сам
# Да блять, єбашим на основі ооп(самого базового) бо то є база, хулі ти хотів
# Удачі,голубець